#include <stdio.h>
#include <math.h>


int main() {
  //Оголошення змінних
  int x, c=0, m;
  float n;

  printf("\n*******************************************\n");
  printf("Запустити програму - 1\n");
  printf("Вийти з програми   - 2\n");
  printf("*******************************************\n");
  
  // Цикл програми
  while (1) {
    // Меню
    if (c == 0) {
      printf("\nВвести: ");
      scanf("%d", &m);
      c++;
    }
    else {
      printf("\n\nВи можете спробувати ще раз - 1 або вийти з програми - 2\n");
      printf("Ввести: ");
      scanf("%d", &m);
      printf("\n---------------------------------------------------------\n");
    }

    if (m==1) {
      // Ввід даних
      printf("\nВведіть n: ");
      scanf("%f", &n);
      printf("Введіть x: ");
      scanf("%d", &x);

      // Обчислення
      float j, i, s1, s2 = 0;
      for (i = 1; i <= n; i++) {
        for (s1 = 0, j = 2; j <= n; j++) {
          s1 += ((x + j + i) / 4);
        }
        s2 += s1;
      }
      // Вивід
      printf("\n***Результати***\n");
      printf("Відповідь: ");
      printf("%.2f\n", s2);
    }

    //Вихід з програми
    else{
      break;
    }
  }
  return 0;
}
