#include <stdio.h>
#include <math.h>


int main() {
  //Оголошення змінних
  int m, a, y, z, n=0;
  float x;

  printf("\n*******************************************\n");
  printf("Запустити програму - 1\n");
  printf("Вийти з програми   - 2\n");
  printf("*******************************************\n");

  // Цикл програми
  while (1) {
    // Меню
    if (n == 0) {
      printf("\nВвести: ");
      scanf("%d", &m);
      n++;
    }
    else {
      printf("\n\nВи можете спробувати ще раз - 1 або вийти з програми - 2\n");
      printf("Ввести: ");
      scanf("%d", &m);
      printf("\n---------------------------------------------------------");
    }

    if (m==1) {
      //Введення даних
      printf("\nВведіть значення a: ");
      scanf("%d", &a);
      printf("Введіть значення y: ");
      scanf("%d", &y);
      printf("Введіть значення z: ");
      scanf("%d", &z);

      // Перевірка на коректність даних
      if( (pow(y,2) - 2*a) < 0) {
        printf("\nДля заданих значень y та a виконується добування кореня з від'ємого числа\n");
        printf("Спробуйте ще раз...\n");
      }
      // Обчислення та виведення
      else {
        x = (float)a * sqrt((pow((float)y,2) - 2*(float)a)) + pow(cos((float)z), 2);
        printf("\n********************\n");
        printf("Відповідь: %.2f", x);
      }
    }
    //Вихід з програми
    else{
      break;
    }
  }
  return 0;
}
